Table of Contents
 Class PretensionedTendonGroupItem
Namespace
IdeaRS.OpenModel.Model
Assembly
IdeaRS.OpenModel.dll
The pretensionede tendon group item
public class PretensionedTendonGroupItem : Tendon
Inheritance
object
OpenObject
OpenElementId
Tendon
PretensionedTendonGroupItem
Inherited Members
 Tendon.Material
 Tendon.NumberOfStrand
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 Geometry
Geometry
public Polygon3D Geometry { get; set; }
Property Value
Polygon3D
 Edit this page